
/****************************************************************************
*
*文件名: DSP28_Gpio.c
*
*功  能: 2812通用输入输出口GPIO的初始化函数
*
*作  者: likyo from hellodsp
*
*版  本: V1.0
*
****************************************************************************/

#include "DSP28_Device.h"

/****************************************************************************
*
*名    称：InitGpio()
*
*功    能：初始化Gpio，使得Gpio的引脚处于已知的状态，例如确定其功能是特定功能
*          还是通用I/O。如果是通用I/O，是输入还是输出，等等。
*
*入口参数：无
*
*出口参数：无
*
****************************************************************************/

void InitGpio(void)
{
  EALLOW;
    
  ///设置SPI口外设功能
  GpioMuxRegs.GPFMUX.bit.SPISIMOA_GPIOF0 = 1;//选择SPISIMO引脚为功能引脚
  GpioMuxRegs.GPFMUX.bit.SPICLKA_GPIOF2  = 1;//选择SPICLK引脚为功能引脚
  GpioMuxRegs.GPFMUX.bit.SPISTEA_GPIOF3=0;   //选择SPISTE引脚为通用I/O

  GpioMuxRegs.GPFDIR.bit.GPIOF3=1; //方向为输出，低电平时选中74HC595
     	 
  EDIS;
}	
	
//===========================================================================
// No more.
//===========================================================================
