
/****************************************************************************
*
*文件名：DSP28_Spi.c
*
*功  能：对2812的SPI模块进行初始化
*
*作  者: likyo from hellodsp
*
****************************************************************************/

#include "DSP28_Device.h"

/****************************************************************************
*
*名    称：InitSpi()
*
*功    能：该函数对2812的SPI进行初始化
*
*入口参数：无
*
*出口参数：无
*
****************************************************************************/

void InitSpi(void)
{

    /*配置控制寄存器设置*/
	SpiaRegs.SPICCR.all = 0x08;///进入初始状态，数据在上升沿输出，自测禁止，8位数据模式
	
	/*操作控制寄存器设置*/
	SpiaRegs.SPICTL.all = 0x06;///正常的SPI时钟方式,主动模式，使能发送,禁止中断
	
	/*波特率的设置*/
	SpiaRegs.SPIBRR = 0x1D;//波特率 = LSPCLK/（SPIBRR+1）= 30/30 = 1M
	
	SpiaRegs.SPICCR.all = 0x8a; //退出初始状态
	
}

/****************************************************************************
*
*名    称：Spi_TxReady()
*
*功    能：查询SPISTS寄存器的BUFFULL_FLAG，来确认发送准备是否就绪
*
*入口参数：无
*
*出口参数：i，即TXRDY的状态
*          1：发送准备已经就绪
*          0：发送准备尚未就绪
*       
****************************************************************************/

unsigned int Spi_TxReady(void)
{
	unsigned int i;
	if(SpiaRegs.SPISTS.bit.BUFFULL_FLAG == 1)//根据SPI的状态寄存器的缓冲标志位是否满,来确定发送函数是否可进行,学习时自己看下即可
	{
		i = 0;
	}
	else
	{
		i = 1;
	}
	return(i);
}

/****************************************************************************
*
*名    称：Spi_RxReady()
*
*功    能：查询SPISTS寄存器的INT_FLAG位，来确认接收准备是否就绪
*
*入口参数：无
*
*出口参数：i，即RXRDY的状态
*          1：接收准备已经就绪
*          0：接收准备尚未就绪
*       
****************************************************************************/

unsigned int Spi_RxReady(void)
{
	unsigned int i;
	if(SpiaRegs.SPISTS.bit.INT_FLAG == 1)
	{
		i = 1;
	}
	else
	{
		i = 0;
	}
	return(i);	
}

/*SPI中断服务寄存器.此实验未使用*/

interrupt void SPIRXINTA_ISR(void);   // SPI
interrupt void SPITXINTA_ISR(void);    // SPI
	
//===========================================================================
// No more.
//===========================================================================
