/*---------------------------------------------
file name:	start.c
2003/09/18	By RealSYS
-----------------------------------------------*/
asm("	.ref _c_int00		");       //引用模块外的符号（起始程序的符号名称）？
asm("   .sect codestart		");      //定义一个codestart的初始化块,上电时BOOT ROM中的复位矢量指向codestart段，
asm("	 LB _c_int00			");  //在该段中包含一条长跳转指令，
                                     //跳到C编译器运行支持库rts2800_ml.lib中的初始化子程序的开始处，
                                     //这个子程序的进入符号为_c_int00
									 //因为2812代码FLASH存储地址是向用户开放的，复位时需告诉CPU程序的初始地址，以便程序正常运行

